Revit 2027 API
RibbonButton.LargeImage Property
The large image shown on the button.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImageSource LargeImage { get; set; }
Public Property LargeImage As ImageSource
	Get
	Set
public:
property ImageSource^ LargeImage {
	ImageSource^ get ();
	void set (ImageSource^ value);
}
member LargeImage : ImageSource with get, set
Property Value
ImageSource
Remarks
The image will be shown on the button in the Ribbon panel if the button is not a part of a stacked set. It will also be shown if the button is added to a pulldown button. The image should be 32 x 32 pixels. If the image is larger it will be adjusted to fit the button.
See Also
Reference
RibbonButton Class
Autodesk.Revit.UI Namespace